// сделать виджет создание и редактирование блока блоков:

// 1)сделать панель фич для создания готовых блоков:

//   1.1)Ввести сущность страница
//   1.2)фичи должны изменять данные страницы, а не блоков
//   1.3)фичи: либо добавить блок, либо удалить блок
//   1.4)добавление блока: использовать предоставленный шаблон или использовать свой собственный настроенный шаблон
//   1.5)механизм страницы: существует стор - в него приходят данные, они отрисовываются, по действию мы меняем стор и так же отправляем изменения на бэкенд.
// 2)сделать сущность блок со стором
// 3)сделать api